# FamilyName Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyLoadedIntoDocumentEventArgs..::..FamilyName Property
FamilyLoadedIntoDocumentEventArgs Class See Also
---
The file name of the family that is loaded into the document.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public string FamilyName { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FamilyName As String
	Get
```

Visual C++
---
```text
public:
property String^ FamilyName {
	String^ get ();
}
```

# See Also
FamilyLoadedIntoDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace